
export interface Representative {
  id?: number;
  name: string;
  province: string;
  city: string;
  phone: string;
  address: string;
}

export const representativesData: Representative[] = [
  {
    id: 1,
    name: 'موبایل کسری',
    province: 'گیلان',
    city: 'رشت',
    phone: '013-33235303',
    address: 'رشت، خیابان لاکانی، جنب بیمه آسیا، موبایل کسری'
  },
  {
    id: 2,
    name: 'موبایل اورژانس',
    province: 'خراسان رضوی',
    city: 'سبزوار',
    phone: '051-44230039',
    address: 'سبزوار، خیابان کاشفی شمالی، نبش کاشفی ۸، اورژانس موبایل'
  },
  {
    id: 3,
    name: 'موبایل وحید',
    province: 'اصفهان',
    city: 'اصفهان',
    phone: '031-32228180',
    address: 'خیابان فردوسی، مجتمع زاینده‌رود، طبقه اول، فروشگاه وحید'
  },
  {
    id: 4,
    name: 'سامسونگ مرکزی',
    province: 'آذربایجان شرقی',
    city: 'تبریز',
    phone: '041-36600150',
    address: 'تبریز، اتوبان پاسداران، میدان فهمیده، مجتمع تجاری لاله پارک، طبقه منفی یک، فروشگاه سامسونگ'
  },
  {
    id: 5,
    name: 'فروشگاه ایران زمین',
    province: 'اصفهان',
    city: 'اصفهان',
    phone: '031-32214031',
    address: 'اصفهان، خیابان فردوسی، روبه‌روی بانک صادرات، فروشگاه ایران زمین'
  },
  {
    id: 6,
    name: 'فروشگاه هایپرفون',
    province: 'فارس',
    city: 'شیراز',
    phone: '071-36290217',
    address: 'شیراز، خیابان عفیف‌آباد، روبه‌روی کوچه ۱، فروشگاه هایپرفون'
  },
  {
    id: 7,
    name: 'فروشگاه کنسل',
    province: 'مازندران',
    city: 'قائم شهر',
    phone: '011-42231256',
    address: 'قائم‌شهر، خیابان امام خمینی، پاساژ نسیم، پلاک ۴۳، طبقه همکف، آقای گرائلی'
  },
  {
    id: 8,
    name: 'شرکت فنی مهندسی نانو',
    province: 'بوشهر',
    city: 'بوشهر',
    phone: '077-33320708',
    address: 'بوشهر، بلوار بهشت صادق، روبه‌روی بانک سپه، طبقه همکف، آقای عبدالرضا کارگر'
  },
  {
    id: 9,
    name: 'آل دیجیتال',
    province: 'کرمان',
    city: 'کرمان',
    phone: '034-32231911',
    address: 'کرمان، خیابان فردوسی، نبش وحشی بافقی، فروشگاه آل دیجیتال'
  },
  {
    id: 10,
    name: 'موبایل آوا',
    province: 'آذربایجان غربی',
    city: 'ارومیه',
    phone: '044-3469061',
    address: 'ارومیه، خیابان مدرس، نبش کوچه ۲۰ متری نوذری، آقای نوید قدرتی'
  },
  {
    id: 11,
    name: 'گروه فنی سپهر پویا',
    province: 'البرز',
    city: 'کرج',
    phone: '026-32233652',
    address: 'کرج، میدان کرج، خیابان شهید دکتر بهشتی، کوچه هما، پاساژ کمالی، گروه فنی سپهر پویا'
  },
  {
    id: 12,
    name: 'فروشگاه موبایل حافظ',
    province: 'مرکزی',
    city: 'اراک',
    phone: '086-42222522',
    address: 'ساوه، خیابان امام، پاساژ رضا، طبقه همکف، پلاک ۶۰، فروشگاه موبایل حافظ'
  },
  {
    id: 13,
    name: 'آقای حامد صمدی',
    province: 'خراسان رضوی',
    city: 'مشهد',
    phone: '0915-5099431',
    address: 'مشهد، احمدآباد، نبش خیابان بهشت، مجتمع موبایل مشهد، طبقه اول اداری، واحد ۴'
  }
];
